relg313/relg313-index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>RELG 313: Introduction to Hebrew Scriptures</title>
<!-- 2016-10-27 Thu 13:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prof. Dale Hathaway" />
<link rel="stylesheet" type="text/css" href="../css/mystyle.css">
</head>
<body>
<div id="content">
<h1 class="title">RELG 313: Introduction to Hebrew Scriptures</h1>
<div class="center">
<p>
<b>Introduction to Hebrew Scriptures</b>
</p>
</div>

<dl class="org-dl">
<dt> RELG 313 </dt><dd>As an <b>introduction</b> this course will provide a variety of tools to enable the student to appreciate and to read with insight the Hebrew Scriptures. As it is about the <b>Hebrew Scriptures</b> (Old Testament) it will emphasize the reading of the text through a variety of lenses that will include but not be limited to the more familiar Christian (New Testament) lens. A major goal of the course is simply to read large sections of the text because this is one of the best ways to become familiar with an original text. The course intends to help the students gain a general familiarity with the contents of the Hebrew Scriptures which span an enormous time frame and include a wide variety of different genre. The course will provide basic tools for interpreting the text and a framework for developing more sophisticated abilities in interpretation.
</dd>
</dl>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Presentations</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><a href="313-week1a.html">Opening</a></td>
<td class="left"><a href="313-week1b.html">Reading a "dusty" old book</a></td>
</tr>

<tr>
<td class="left"><a href="313-week2a.html">Opening Genesis</a></td>
<td class="left"><a href="313-week2b.html">Listening to the text</a></td>
</tr>

<tr>
<td class="left"><a href="313-week3a.html">questioning the text</a></td>
<td class="left"><a href="313-week3b.html">Exodus</a></td>
</tr>

<tr>
<td class="left"><a href="313-week4a.html">Covenant</a></td>
<td class="left"><a href="313-week4b.html">Deuteronomy</a></td>
</tr>

<tr>
<td class="left"><a href="313-week6a.html">Deuteronomic History</a></td>
<td class="left"><a href="313-week6b.html">Josh-Judges</a></td>
</tr>

<tr>
<td class="left"><a href="313-week7a.html">Monarchy 1</a></td>
<td class="left"><a href="313-week7b.html">Monarchy 2</a></td>
</tr>

<tr>
<td class="left"><a href="313-week9a.html">Hebrew Poetry</a></td>
<td class="left"><a href="313-week9b.html">Hebrew Poetry, pt2</a></td>
</tr>

<tr>
<td class="left"><a href="https://docs.google.com/presentation/d/1yebbrRXR7kua55xhsPcDaMbJOdG5YBk_u--rY6nnfW8/edit?usp=sharing">Prophets 1</a></td>
<td class="left"><a href="https://docs.google.com/presentation/d/1vSqm0ED14BiJteN76EMKRIYBPW8OUcNUhMpk7cBq-aM/edit?usp=sharing">Prophets 2</a></td>
</tr>

<tr>
<td class="left"><a href="https://docs.google.com/presentation/d/1I30Yz2iItmoI7tr8sfDfDeChka3bVIuQeL9HChpmN9I/edit?usp=sharing">Siege of Sennacherib</a></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Reading Journals</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="313-journals.html">Reading Journal Assignments</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Resources</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="biblical-research-101.html">Internet based research</a>
</p>

<p>
<a href="library-bible-resources.html">Library based references</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
    <p class="postamble">Last Updated .</p> 
</div>
</body>
</html>
